WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetDouble_Client_Request-14.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetDouble</a:Action>
    <a:MessageID>urn:uuid:ee002c70-c51c-4652-844a-df70eb8602b2</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDouble xmlns="http://tempuri.org/">
      <inDouble xmlns="">1.4142135623730952</inDouble>
    </RetDouble>
  </s:Body>
</s:Envelope>